Revit 2024 API
TopographySurface.Create Method
Overload List
Name | Description
Create(Document, IList<XYZ>) |  Obsolete.
 Creates a new topography surface element and adds it to the document.
Create(Document, IList<XYZ>, IList<PolymeshFacet>) |  Obsolete.
 Creates a new topography surface element from facets and adds it to the document.
See Also
TopographySurface Class
TopographySurface Members
Autodesk.Revit.DB.Architecture Namespace